Revit 2026 API

# FamilyParameter Properties

---

The FamilyParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssociatedParameters | The parameters from elements in the family which are associated to this parameter. |
|  | CanAssignFormula | Indicates if this parameter can be assigned a formula. |
|  | Definition | The definition. |
|  | Formula | The formula. |
|  | GUID | The globally unique identifier |
|  | Id | The id of the family parameter. |
|  | IsDeterminedByFormula | Indicates if the parameter is determined by formula. |
|  | IsInstance | Indicates if the parameter is instance or type. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Overrides APIObjectIsReadOnly) |
|  | IsReporting | Indicates if the parameter is a reporting parameter. |
|  | IsShared | Identifies if the parameter is a shared parameter. |
|  | StorageType | The storage type describes the type that is used internally within the parameter to store its value. |
|  | UserModifiable | Indicates whether the interactive user can modify the value of this parameter. |

#### Reference

FamilyParameter Class

Autodesk.Revit.DB Namespace